"Volume" = "Äänenvoimakkuus"; 
"Balance" = "Balanssi"; 
"Modulation" = "Modulaatio"; 
"Harmonics" = "Harmoninen taso"; 
"Harmonic Steps" = "Harmoninen askel"; 
"Cutoff" = "Leikkaus"; 
"Cutoff Steps" = "Leikkausaskel"; 
"Duration" = "Kesto"; 